app/controllers/toys_controller.rb

  def update

    @toy = Toy.find(params[:id])
    # fail
    @toy.update(toy_params)
---
SELECT  "toys".* FROM "toys" WHERE "toys"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "toys" SET "pokemon_id" = $1, "updated_at" = $2 WHERE "toys"."id" = $3  [["pokemon_id", 9], ["updated_at", "2015-09-07 22:05:57.014842"], ["id", 3]]